let quizQuestions = [
    {
        "questionId": 1,
        "question": "Абстрагування - це",
        "answers": [
            {
                "value": "A",
                "content": "виділення істотних аспектів системи і відволікання від несуттєвих"
            },
            {
                "value": "B",
                "content": "загальне методологічне вирішення проблеми"
            },
            {
                "value": "C",
                "content": "організація складових частин проблеми в деревовидні структури з додаванням нових деталей на кожному рівні"
            }
        ],
        "correctAnswer": "A"
    },
    {
        "questionId": 2,
        "question": "Архітектура системи - це",
        "answers": [
            {
                "value": "A",
                "content": "структурна схема інтерфейсів системи, що взаємодіють між собою через компоненти"
            },
            {
                "value": "B",
                "content": "структурна схема компонентів системи, які не взаємодіють між собою"
            },
            {
                "value": "C",
                "content": "структурна схема компонентів системи, що взаємодіють між собою через інтерфейси"
            }
        ],
        "correctAnswer": "C"
    },
    {
        "questionId": 3,
        "question": "В обов'язки інженера-тестувальника не включаються:",
        "answers": [
            {
                "value": "A",
                "content": "оцінка тестів"
            },
            {
                "value": "B",
                "content": "створення тестових сценаріїв"
            },
            {
                "value": "C",
                "content": "виправлення помилок, виявлених на етапі тестування"
            },
            {
                "value": "D",
                "content": "складання плану тесту"
            }
        ],
        "correctAnswer": "C"
    },
    {
        "questionId": 4,
        "question": "Валідація вимог - це:",
        "answers": [
            {
                "value": "A",
                "content": "перевірка повноти, несуперечності і однозначності специфікації і правильності виконання функцій системи відповідно до вимог"
            },
            {
                "value": "B",
                "content": "процес виявлення помилок в представленні сценарних вимог"
            },
            {
                "value": "C",
                "content": "висновок про коректність створеної програмної системи після завершення її розробки"
            }
        ],
        "correctAnswer": "B"
    },
    {
        "questionId": 5,
        "question": "Визначення вимог, як правило, проводиться:",
        "answers": [
            {
                "value": "A",
                "content": "шляхом обговорення поглядів замовника на систему з майбутніми її розробниками"
            },
            {
                "value": "B",
                "content": "шляхом обговорення системи між майбутніми її розробниками без участі замовника"
            },
            {
                "value": "C",
                "content": "шляхом збору вимог до системи замовника без участі майбутніх її розробників"
            }
        ],
        "correctAnswer": "A"
    },
    {
        "questionId": 6,
        "question": "Вимоги - це",
        "answers": [
            {
                "value": "A",
                "content": "високорівневе представлення структури системи і специфікація її компонентів"
            },
            {
                "value": "B",
                "content": "властивості, якими має володіти ПО для адекватного визначення функцій, умов і обмежень виконання програмного забезпечення, а також обсягів даних, технічного забезпечення та середовища функціонування"
            },
            {
                "value": "C",
                "content": "сукупність дій по забезпеченню роботи програмного забезпечення"
            }
        ],
        "correctAnswer": "B"
    },
    {
        "questionId": 7,
        "question": "Вимоги користувачів визначають",
        "answers": [
            {
                "value": "A",
                "content": "перелік функцій або сервісів, які повинна виконувати система, а також обмежень на дані і поведінку системи"
            },
            {
                "value": "B",
                "content": "мету і завдання, які користувачам дозволить вирішувати майбутня система"
            },
            {
                "value": "C",
                "content": "зовнішні умови для виконання системних функцій і обмежень на створюваний продукт, а також вимоги до опису підсистем"
            }
        ],
        "correctAnswer": "B"
    },
    {
        "questionId": 8,
        "question": "Відповідальність за ідейну, функціональну сторону проекту несе",
        "answers": [
            {
                "value": "A",
                "content": "менеджер проекту"
            },
            {
                "value": "B",
                "content": "головний програміст"
            },
            {
                "value": "C",
                "content": "системний адміністратор"
            }
        ],
        "correctAnswer": "A"
    },
    {
        "questionId": 9,
        "question": "Відповідальність за координацію і реалізацію основних складових проекту несе",
        "answers": [
            {
                "value": "A",
                "content": "менеджер проекту"
            },
            {
                "value": "B",
                "content": "головний програміст"
            },
            {
                "value": "C",
                "content": "системний адміністратор"
            }
        ],
        "correctAnswer": "B"
    },
    {
        "questionId": 10,
        "question": "Відповідно до міжнародного стандарту ANSI / IEEE-729-83 Відмова (failure) - це",
        "answers": [
            {
                "value": "A",
                "content": "наслідок помилок розробника на будь-якому з етапів розробки, яка може міститися в початкових або проектних специфікаціях, текстах кодів програм, експлуатаційної документації та тп"
            },
            {
                "value": "B",
                "content": "стан програми, при якому видаються неправильні результати, причиною яких є вади в операторах програми або в технологічному процесі її розробки"
            },
            {
                "value": "C",
                "content": "відхилення програми від правильного функціонування або неможливість програми виконувати функції, визначені вимогами і обмеженнями"
            }
        ],
        "correctAnswer": "C"
    },
    {
        "questionId": 11,
        "question": "Відповідно до міжнародного стандарту ANSI / IEEE-729-83 дефект (fault) - це",
        "answers": [
            {
                "value": "A",
                "content": "наслідок помилок розробника на будь-якому з етапів розробки, яка може міститися в початкових або проектних специфікаціях, текстах кодів програм, експлуатаційної документації та тп"
            },
            {
                "value": "B",
                "content": "стан програми, при якому видаються неправильні результати, причиною яких є вади в операторах програми або в технологічному процесі її розробки"
            },
            {
                "value": "C",
                "content": "відхилення програми від функціонування або неможливість програми виконувати функції, визначені вимогами і обмеженнями"
            }
        ],
        "correctAnswer": "A"
    },
    {
        "questionId": 12,
        "question": "Відповідно до міжнародного стандарту ANSI / IEEE-729-83 Помилка (error) - це:",
        "answers": [
            {
                "value": "A",
                "content": "наслідок помилок розробника на будь-якому з етапів розробки, яка може міститися в початкових або проектних специфікаціях, текстах кодів програм, експлуатаційної документації тощо"
            },
            {
                "value": "B",
                "content": "стан програми, при якому видаються неправильні результати, причиною яких є вади в операторах програми або в технологічному процесі її розробки"
            },
            {
                "value": "C",
                "content": "відхилення програми від функціонування або неможливість програми виконувати функції, визначені вимогами і обмеженнями"
            }
        ],
        "correctAnswer": "B"
    },
    {
        "questionId": 13,
        "question": "Головна мета об'єктного аналізу - це:",
        "answers": [
            {
                "value": "A",
                "content": "побудувати архітектуру системи для аналізованої предметної області"
            },
            {
                "value": "B",
                "content": "визначити набір зв'язків, які мають місце між різними видами об'єктів предметної області"
            },
            {
                "value": "C",
                "content": "представити предметну область як множину об'єктів з властивостями і характеристиками, які є достатніми для їх визначення і ідентифікації, а також для завдання поведінки об'єктів в рамках обраної системи понять і абстракцій"
            }
        ],
        "correctAnswer": "C"
    },
    {
        "questionId": 14,
        "question": "Динамічні методи тестування використовуються:",
        "answers": [
            {
                "value": "A",
                "content": "при проведенні інспекцій та розгляді специфікацій компонентів"
            },
            {
                "value": "B",
                "content": "при впровадженні програми"
            },
            {
                "value": "C",
                "content": "в процесі виконання програм"
            }
        ],
        "correctAnswer": "C"
    },
    {
        "questionId": 15,
        "question": "Діаграма Ганта",
        "answers": [
            {
                "value": "A",
                "content": "дерево, що показує ієрархічність результатів проекту"
            },
            {
                "value": "B",
                "content": "дерево, що показує розподіл завдань необхідних для досягнення цілі."
            },
            {
                "value": "C",
                "content": "граф взаємозв'язків між роботами проекту плану з вказанням тривалості окремих робіт"
            },
            {
                "value": "D",
                "content": "графік робіт за проектом з вказаними календарними датами"
            }
        ],
        "correctAnswer": "D"
    },
    {
        "questionId": 16,
        "question": "До складових надійності програмного забезпечення не належить:",
        "answers": [
            {
                "value": "A",
                "content": "безвідмовність"
            },
            {
                "value": "B",
                "content": "стійкість до помилок"
            },
            {
                "value": "C",
                "content": "функціональна повнота"
            },
            {
                "value": "D",
                "content": "відновлюванність"
            }
        ],
        "correctAnswer": "C"
    },
    {
        "questionId": 17,
        "question": "Життєвий цикл програмної системи - це:",
        "answers": [
            {
                "value": "A",
                "content": "тексти вимог до розробки програмної системи і узгоджені з замовником домовленості"
            },
            {
                "value": "B",
                "content": "дії підприємства-розробника програмного продукту, починаючи від постановки задачі до її втілення в готову програму, експлуатації та вилучення з експлуатації"
            },
            {
                "value": "C",
                "content": "певна послідовність процесів (етапів) від постановки задачі до її втілення в готову програму, експлуатації та вилучення з експлуатації"
            }
        ],
        "correctAnswer": "C"
    },
    {
        "questionId": 19,
        "question": "Збірка програмного забезпечення - це:",
        "answers": [
            {
                "value": "A",
                "content": "набір елементів програмного забезпечення, зафіксований на етапах життєвого циклу програмного забезпечення"
            },
            {
                "value": "B",
                "content": "об'єднання коректних елементів програмного забезпечення і конфігураційних даних в єдину виконувану програму"
            },
            {
                "value": "C",
                "content": "колекція об'єктів програмного забезпечення і документації, призначена для полегшення процесу розробки, використання і супроводу програмного забезпечення"
            }
        ],
        "correctAnswer": "B"
    },
    {
        "questionId": 20,
        "question": "Зручність застосування - це:",
        "answers": [
            {
                "value": "A",
                "content": "група властивостей програмного забезпечення, що зумовлює його здатність виконувати певний перелік функцій, які задовольняють потребам відповідно до призначення"
            },
            {
                "value": "B",
                "content": "група властивостей, що обумовлює здатність програмного забезпечення зберігати працездатність і перетворювати вихідні дані в результат за встановлений період часу, характер відмов якого є наслідком внутрішніх дефектів і умов його застосування"
            },
            {
                "value": "C",
                "content": "сукупність властивостей програмного забезпечення для передбачуваного кола користувачів і відображають легкість його освоєння і адаптації до постійно змінюваних умов експлуатації, стабільність роботи і підготовки даних, зрозумілість результатів, зручності внесення змін до програмної документацію і в програми"
            }
        ],
        "correctAnswer": "C"
    },
    {
        "questionId": 21,
        "question": "Інженерія вимог",
        "answers": [
            {
                "value": "A",
                "content": "Виявлення, аналіз, специфікація, перевірка потреб користувача, або властивостей розроблюваного ПЗ"
            },
            {
                "value": "B",
                "content": "Процес визначення архітектури, складу компонентів, інтерфейсів та інших характеристик до системи."
            },
            {
                "value": "C",
                "content": "Кодування, модульне та інтеграційне тестування, відлагодження."
            },
            {
                "value": "D",
                "content": "Перевірка поведінки системи на відповідність до специфікації, пошук дефектів."
            },
            {
                "value": "E",
                "content": "Поліпшення, оптимізація системи та процесів роботи з нею після вводу до експлуатації."
            }
        ],
        "correctAnswer": "A"
    },
    {
        "questionId": 22,
        "question": "Інженерія якості - це",
        "answers": [
            {
                "value": "A",
                "content": "набір методів і заходів, за допомогою яких програмні продукти перевіряються на виконання вимог до якості і забезпечуються характеристиками, передбаченими у вимогах на ПО"
            },
            {
                "value": "B",
                "content": "набір організаційних структур, методик, заходів, процесів і ресурсів для здійснення керування якістю"
            },
            {
                "value": "C",
                "content": "оцінка стандартів і процедур, які виконуються при розробці програм"
            }
        ],
        "correctAnswer": "A"
    },
    {
        "questionId": 23,
        "question": "Інспекція програмного забезпечення - це",
        "answers": [
            {
                "value": "A",
                "content": "статична перевірка відповідності програми заданим специфікаціями"
            },
            {
                "value": "B",
                "content": "динамічна перевірка відповідності програми заданим специфікаціями"
            },
            {
                "value": "C",
                "content": "функціональна перевірка відповідності програми заданим специфікаціями"
            }
        ],
        "correctAnswer": "A"
    },
    {
        "questionId": 24,
        "question": "Інструментальні засоби розробки програмного забезпечення це",
        "answers": [
            {
                "value": "A",
                "content": "організаційні засоби планування та відбору тестів для програм"
            },
            {
                "value": "B",
                "content": "метрики вимірювання (Холстеда, цікломатічная складність Маккейб і ін)"
            },
            {
                "value": "C",
                "content": "засоби підтримки кодування і тестування (компілятори, генератори програм, отладчики і ін)"
            }
        ],
        "correctAnswer": "C"
    },
    {
        "questionId": 25,
        "question": "Інтенсивність відмов - це",
        "answers": [
            {
                "value": "A",
                "content": "перехід програмних систем з працюючого стану в неробочий, або коли отримані результати не відповідають заданим допустимим значенням"
            },
            {
                "value": "B",
                "content": "наслідок помилок розробника на будь-якому з процесів розробки"
            },
            {
                "value": "C",
                "content": "частота появи відмов або дефектів в програмних системах при їх тестуванні або експлуатації"
            }
        ],
        "correctAnswer": "C"
    },
    {
        "questionId": 26,
        "question": "Керування проектом - це",
        "answers": [
            {
                "value": "A",
                "content": "керівництво роботами команди виконавців проекту для реалізації проекту з використанням методів керування, планування і контролю робіт, керування ризиками, ефективною організацією роботи і комунікаційними потоками в команді виконавців"
            },
            {
                "value": "B",
                "content": "процес розподілу і призначення ресурсів (матеріальних і людських) з урахуванням вартості і часу виконання проекту"
            },
            {
                "value": "C",
                "content": "сукупність організаційної структури та відповідальних осіб, а також процедур, процесів і ресурсів для планування і керування досягненням якості програмних систем"
            }
        ],
        "correctAnswer": "A"
    },
    {
        "questionId": 27,
        "question": "Кількісна оцінка ризиків - це",
        "answers": [
            {
                "value": "A",
                "content": "процес прийняття рішень щодо попередження ризиків, або зменшення їх наслідків"
            },
            {
                "value": "B",
                "content": "процес визначення ймовірності виникнення ризиків, впливу наслідків ризиків на проект і прийняття рішень з оцінки ризику"
            },
            {
                "value": "C",
                "content": "розробка методів і технологій зниження негативного впливу ризиків на проект"
            }
        ],
        "correctAnswer": "B"
    },
    {
        "questionId": 28,
        "question": "Конструювання ПЗ",
        "answers": [
            {
                "value": "A",
                "content": "Виявлення, аналіз, специфікація, перевірка потреб користувача, або властивостей розроблюваного ПЗ."
            },
            {
                "value": "B",
                "content": "Процес визначення архітектури, складу компонентів, інтерфейсів та інших характеристик до системи."
            },
            {
                "value": "C",
                "content": "Кодування, модульне та інтеграційне тестування, відлагодження."
            },
            {
                "value": "D",
                "content": "Перевірка поведінки системи на відповідність до специфікації, пошук дефектів."
            },
            {
                "value": "E",
                "content": "Поліпшення, оптимізація системи та процесів роботи з нею після вводу до експлуатації."
            }
        ],
        "correctAnswer": "C"
    },
    {
        "questionId": 29,
        "question": "Мережевий графік",
        "answers": [
            {
                "value": "A",
                "content": "дерево, що показує ієрархічність результатів проекту"
            },
            {
                "value": "B",
                "content": "дерево, що показує розподіл завдань необхідних для досягнення цілі."
            },
            {
                "value": "C",
                "content": "граф взаємозв'язків між роботами проекту плану з вказанням тривалості окремих робіт"
            },
            {
                "value": "D",
                "content": "графік робіт за проектом з вказаними календарними датами"
            }
        ],
        "correctAnswer": "C"
    },
    {
        "questionId": 30,
        "question": "Мета процесу валідації:",
        "answers": [
            {
                "value": "A",
                "content": "переконатися, що специфічні вимоги для програмного продукту виконані"
            },
            {
                "value": "B",
                "content": "виявити помилки в програмному забезпеченні шляхом виконання вихідного коду програмних систем на тестових даних і збору робочих характеристик в динаміці виконання в конкретній операційному середовищі"
            },
            {
                "value": "C",
                "content": "переконатися, що готова продукція дійсно задовольняє свого вихідного призначенню"
            }
        ],
        "correctAnswer": "A"
    },
    {
        "questionId": 31,
        "question": "Модель керування ризиками - це:",
        "answers": [
            {
                "value": "A",
                "content": "модель, яка визначає структуру процесів і керівництво ними протягом усього часу життя проекту"
            },
            {
                "value": "B",
                "content": "модель, за допомогою якої визначається порядок і умови реалізації превентивних рішень і заходів щодо виявлення найбільш істотних моментів ризику"
            },
            {
                "value": "C",
                "content": "модель, яка визначає цілі та завдання процесу розробки виробничої архітектури з паралельним і ітераційним виконанням окремих робіт"
            }
        ],
        "correctAnswer": "B"
    },
    {
        "questionId": 32,
        "question": "Модель проектної групи - це:",
        "answers": [
            {
                "value": "A",
                "content": "набір принципів, що забезпечують створення організаційної структури ІТ-підприємства"
            },
            {
                "value": "B",
                "content": "модель, яка визначає ролі, обов'язки кожного учасника проекту і розподіл між ними відповідальності"
            },
            {
                "value": "C",
                "content": "трирівнева структура, сценарний метод проектування і розробки програми"
            }
        ],
        "correctAnswer": "B"
    },
    {
        "questionId": 33,
        "question": "Модель процесу проектування - це:",
        "answers": [
            {
                "value": "A",
                "content": "модель, яка визначає структуру процесів і керівництво ними протягом усього часу життя проекту"
            },
            {
                "value": "B",
                "content": "модель, за допомогою якої визначається порядок і умови реалізації превентивних рішень і заходів щодо виявлення найбільш істотних моментів ризику"
            },
            {
                "value": "C",
                "content": "модель, яка визначає цілі та завдання процесу розробки виробничої архітектури з паралельним і ітераційним виконанням окремих робіт"
            }
        ],
        "correctAnswer": "C"
    },
    {
        "questionId": 34,
        "question": "Модель процесу розробки програмного забезпечення - це:",
        "answers": [
            {
                "value": "A",
                "content": "модель, яка визначає структуру процесів і керівництво ними протягом усього часу життя проекту"
            },
            {
                "value": "B",
                "content": "модель, за допомогою якої визначається порядок і умови реалізації превентивних рішень і заходів щодо виявлення найбільш істотних моментів ризику"
            },
            {
                "value": "C",
                "content": "модель, яка визначає цілі та завдання процесу розробки виробничої архітектури з паралельним і ітераційним виконанням окремих робіт"
            }
        ],
        "correctAnswer": "A"
    },
    {
        "questionId": 35,
        "question": "Надійність - це",
        "answers": [
            {
                "value": "A",
                "content": "група властивостей програмного забезпечення, що зумовлює його здатність виконувати певний перелік функцій, які задовольняють потребам відповідно до призначення"
            },
            {
                "value": "B",
                "content": "група властивостей, що обумовлює здатність програмного забезпечення зберігати працездатність і перетворювати вихідні дані в результат за встановлений період часу, характер відмов якого є наслідком внутрішніх дефектів і умов його застосування"
            },
            {
                "value": "C",
                "content": "сукупність властивостей програмного забезпечення для передбачуваного кола користувачів і відображають легкість його освоєння і адаптації до постійно змінюваних умов експлуатації, стабільність роботи і підготовки даних, зрозумілість результатів, зручності внесення змін до програмної документацію і в програми"
            }
        ],
        "correctAnswer": "B"
    },
    {
        "questionId": 36,
        "question": "Налагодження - це",
        "answers": [
            {
                "value": "A",
                "content": "перевірка змісту коду програмного об'єкта на мові програмування з метою виявлення в ньому помилок без подальшого їх усунення"
            },
            {
                "value": "B",
                "content": "створення змісту коду програмного об'єкта на мові програмування, перевірка створеного змісту з метою виявлення в ньому помилок і подальше їх усунення"
            },
            {
                "value": "C",
                "content": "перевірка змісту коду програмного об'єкта на мові програмування з метою виявлення в ньому помилок і подальше їх усунення"
            }
        ],
        "correctAnswer": "C"
    },
    {
        "questionId": 37,
        "question": "Напрацювання на відмову як складова надійності визначає",
        "answers": [
            {
                "value": "A",
                "content": "захищеність програми"
            },
            {
                "value": "B",
                "content": "середній час між появою загроз"
            },
            {
                "value": "C",
                "content": "оптимальний час роботи системи"
            }
        ],
        "correctAnswer": "B"
    },
    {
        "questionId": 38,
        "question": "Нефункціональні вимоги визначають",
        "answers": [
            {
                "value": "A",
                "content": "зовнішні умови для виконання системних функцій і обмежень на створюваний продукт, а також вимоги до опису підсистем"
            },
            {
                "value": "B",
                "content": "призначені для користувача потреби до умов і середовищ виконання функцій"
            },
            {
                "value": "C",
                "content": "деякі обмеження до властивостей функцій або до системи, важливих для користувачів або розробників"
            }
        ],
        "correctAnswer": "B"
    },
    {
        "questionId": 39,
        "question": "Об'єктно-орієнтований підхід (ООП) - це",
        "answers": [
            {
                "value": "A",
                "content": "парадигма побудови гнучких до зміни програмних систем шляхом додавання нових аспектів (функцій), які забезпечують безпеку і взаємодія компонентів з іншим середовищем"
            },
            {
                "value": "B",
                "content": "стратегія розробки, в рамках якої розробники системи замість операцій і функцій мислять об'єктами"
            },
            {
                "value": "C",
                "content": "теорія дескриптивних та декларативних програмних формализмів, адекватних моделей структур даних"
            }
        ],
        "correctAnswer": "B"
    },
    {
        "questionId": 40,
        "question": "Переносимість - це",
        "answers": [
            {
                "value": "A",
                "content": "група властивостей, що визначає зусилля, необхідні для виконання, пристосованість до діагностики відмов і наслідків внесення змін, модифікації і атестації модифікованого програмного забезпечення"
            },
            {
                "value": "B",
                "content": "група властивостей, що характеризується ступенем відповідності використовуваних ресурсів середовища функціонування рівню якості (надійності) функціонування програмного забезпечення при заданих умовах застосування"
            },
            {
                "value": "C",
                "content": "група властивостей програмного забезпечення, що забезпечує його пристосованість для перенесення з одного середовища функціонування в інші, зусилля для перенесення і адаптацію програмного забезпечення до нового середовища функціонування"
            }
        ],
        "correctAnswer": "C"
    },
    {
        "questionId": 41,
        "question": "Планування - це",
        "answers": [
            {
                "value": "A",
                "content": "керівництво роботами команди виконавців проекту для реалізації проекту з використанням методів керування, планування і контролю робіт, керування ризиками, ефективною організацією роботи і комунікаційними потоками в команді виконавців"
            },
            {
                "value": "B",
                "content": "процес розподілу і призначення ресурсів (матеріальних і людських) з урахуванням вартості і часу виконання проекту"
            },
            {
                "value": "C",
                "content": "сукупність організаційної структури та відповідальних осіб, а також процедур, процесів і ресурсів для планування і керування досягненням якості програмних систем"
            }
        ],
        "correctAnswer": "B"
    },
    {
        "questionId": 42,
        "question": "Планування керування ризиками - це",
        "answers": [
            {
                "value": "A",
                "content": "процес прийняття рішень щодо попередження ризиків, або зменшення їх наслідків"
            },
            {
                "value": "B",
                "content": "процес якісного аналізу ідентифікації ризиків і оцінка ризику, що вимагає швидкого реагування"
            },
            {
                "value": "C",
                "content": "розробка методів і технологій зниження негативного впливу ризиків на проект"
            }
        ],
        "correctAnswer": "A"
    },
    {
        "questionId": 43,
        "question": "Планування якості являє собою",
        "answers": [
            {
                "value": "A",
                "content": "діяльність, спрямовану на визначення цілей і вимог до якості"
            },
            {
                "value": "B",
                "content": "методи і види діяльності оперативного характеру для поточного керування процесом проектування і усунення причин поганого чи неналежного функціонування програмних систем"
            },
            {
                "value": "C",
                "content": "виконання і перевірку того, що об'єкт розробки виконує зазначені вимоги до якості"
            }
        ],
        "correctAnswer": "A"
    },
    {
        "questionId": 44,
        "question": "При підході, орієнтованому на продукт, оцінка якості проводиться після випробування програмних систем. Цей підхід базується на припущенні, що",
        "answers": [
            {
                "value": "A",
                "content": "чим швидше проведені випробування продукту, тим вище його якість"
            },
            {
                "value": "B",
                "content": "чим більше виявлено та усунуто помилок в процесі випробування продукту, тим вище його якість"
            },
            {
                "value": "C",
                "content": "чим менше виявлено та усунуто помилок в продукті при випробуваннях, тим вище його якість"
            }
        ],
        "correctAnswer": "B"
    },
    {
        "questionId": 45,
        "question": "Програмні системи слід відносити до класу",
        "answers": [
            {
                "value": "A",
                "content": "невідновлювальних систем"
            },
            {
                "value": "B",
                "content": "систем, що самовідновлюються"
            },
            {
                "value": "C",
                "content": "систем, що саморуйнуються"
            }
        ],
        "correctAnswer": "A"
    },
    {
        "questionId": 46,
        "question": "Проектування",
        "answers": [
            {
                "value": "A",
                "content": "Виявлення, аналіз, специфікація, перевірка потреб користувача, або властивостей розроблюваного ПЗ"
            },
            {
                "value": "B",
                "content": "Процес визначення архітектури, складу компонентів, інтерфейсів та інших характеристик до системи."
            },
            {
                "value": "C",
                "content": "Кодування, модульне та інтеграційне тестування, відлагодження."
            },
            {
                "value": "D",
                "content": "Перевірка поведінки системи на відповідність до специфікації, пошук дефектів."
            },
            {
                "value": "E",
                "content": "Поліпшення, оптимізація системи та процесів роботи з нею після вводу до експлуатації."
            }
        ],
        "correctAnswer": "B"
    },
    {
        "questionId": 47,
        "question": "Процес перевірки правильності специфікацій вимог на їх відповідність, несуперечність, повноту і здійсненність, а також на відповідність стандартам - це",
        "answers": [
            {
                "value": "A",
                "content": "валідація вимог"
            },
            {
                "value": "B",
                "content": "верифікація вимог"
            },
            {
                "value": "C",
                "content": "специфікація вимог до ПО"
            }
        ],
        "correctAnswer": "B"
    },
    {
        "questionId": 48,
        "question": "Раціональність (ефективність) - це група властивостей, що",
        "answers": [
            {
                "value": "A",
                "content": "визначає зусилля, необхідні для виконання, пристосованість до діагностики відмов і наслідків внесення змін, модифікації і атестації модифікованого програмного забезпечення (ПЗ)"
            },
            {
                "value": "B",
                "content": "характеризується ступенем відповідності використовуваних ресурсів середовища функціонування рівню якості (надійності) функціонування ПЗ при заданих умовах застосування"
            },
            {
                "value": "C",
                "content": "що забезпечує пристосованість ПЗ для перенесення з одного середовища функціонування в інші, зусилля для перенесення та адаптації ПЗ до нового середовища функціонування"
            }
        ],
        "correctAnswer": "B"
    },
    {
        "questionId": 49,
        "question": "Реінженерія - це",
        "answers": [
            {
                "value": "A",
                "content": "удосконалення застарілого ПЗ шляхом його реорганізації або реструктуризації, а також перепрограмування окремих елементів або настроювання параметрів на іншу платформу, середовище виконання зі збереженням зручності його супроводу"
            },
            {
                "value": "B",
                "content": "перетворення програмного коду, зміна внутрішньої структури програмного забезпечення для полегшення розуміння коду і легшого внесення подальших змін без зміни зовнішньої поведінки самої системи"
            },
            {
                "value": "C",
                "content": "процес створення документації для існуючого та успадкованого програмного забезпечення"
            }
        ],
        "correctAnswer": "A"
    },
    {
        "questionId": 50,
        "question": "Реорганізація коду для поліпшення характеристик і показників якості програм без зміни їх поведінки - це",
        "answers": [
            {
                "value": "A",
                "content": "реінженерія"
            },
            {
                "value": "B",
                "content": "рефакторинг"
            },
            {
                "value": "C",
                "content": "реверсна інженерія"
            }
        ],
        "correctAnswer": "B"
    },
    {
        "questionId": 51,
        "question": "Рефакторинг - це",
        "answers": [
            {
                "value": "A",
                "content": "удосконалення застарілого ПЗ шляхом його реорганізації або реструктуризації, а також перепрограмування окремих елементів або настроювання параметрів на іншу платформу, середовище виконання зі збереженням зручності його супроводу"
            },
            {
                "value": "B",
                "content": "перетворення програмного коду, зміна внутрішньої структури програмного забезпечення для полегшення розуміння коду і легшого внесення подальших змін без зміни зовнішньої поведінки самої системи"
            },
            {
                "value": "C",
                "content": "процес створення документації для існуючого та успадкованого програмного забезпечення"
            }
        ],
        "correctAnswer": "B"
    },
    {
        "questionId": 52,
        "question": "Системні вимоги визначають",
        "answers": [
            {
                "value": "A",
                "content": "перелік функцій або сервісів, які повинна виконувати система, а також обмежень на дані і поведінку системи"
            },
            {
                "value": "B",
                "content": "мети і завдання, які користувачам дозволить вирішувати майбутня система"
            },
            {
                "value": "C",
                "content": "зовнішні умови для виконання системних функцій і обмежень на створюваний продукт, а також вимоги до опису підсистем"
            }
        ],
        "correctAnswer": "C"
    },
    {
        "questionId": 53,
        "question": "Специфікація вимог до програмного забезпечення - це",
        "answers": [
            {
                "value": "A",
                "content": "формалізований опис функціональних, нефункціональних і системних вимог, вимог до характеристик якості, а також до структури програмного забезпечення, принципам взаємодії з іншими компонентами, алгоритмам і структурі даних системи"
            },
            {
                "value": "B",
                "content": "перевірка вимог, для того щоб переконатися, що вони визначають саме дану систему"
            },
            {
                "value": "C",
                "content": "процес перевірки правильності специфікації вимог на їх відповідність, несуперечність, повноту і здійсненність, а також на відповідність стандартам"
            }
        ],
        "correctAnswer": "A"
    },
    {
        "questionId": 54,
        "question": "Статичний аналіз програмного забезпечення полягає в",
        "answers": [
            {
                "value": "A",
                "content": "перевірці проходження всіх шляхів програм"
            },
            {
                "value": "B",
                "content": "інспекції вихідного коду і наскрізному контролю програми"
            },
            {
                "value": "C",
                "content": "накопиченні інформації про помилки"
            },
            {
                "value": "D",
                "content": "перевірці коректності програмних систем на множині тестів"
            }
        ],
        "correctAnswer": "B"
    },
    {
        "questionId": 55,
        "question": "Структурна декомпозиція продукту",
        "answers": [
            {
                "value": "A",
                "content": "дерево, що показує ієрархічність результатів проекту"
            },
            {
                "value": "B",
                "content": "дерево, що показує розподіл завдань необхідних для досягнення цілі."
            },
            {
                "value": "C",
                "content": "граф взаємозв'язків між роботами проекту плану з вказанням тривалості окремих робіт"
            },
            {
                "value": "D",
                "content": "графік робіт за проектом з вказаними календарними датами"
            }
        ],
        "correctAnswer": "A"
    },
    {
        "questionId": 56,
        "question": "Структурна декомпозиція робіт",
        "answers": [
            {
                "value": "A",
                "content": "дерево, що показує ієрархічність результатів проекту"
            },
            {
                "value": "B",
                "content": "дерево, що показує розподіл завдань необхідних для досягнення цілі"
            },
            {
                "value": "C",
                "content": "граф взаємозв'язків між роботами проекту плану з вказанням тривалості окремих робіт"
            },
            {
                "value": "D",
                "content": "графік робіт за проектом з вказаними календарними датами"
            }
        ],
        "correctAnswer": "B"
    },
    {
        "questionId": 57,
        "question": "Супровід програмного забезпечення",
        "answers": [
            {
                "value": "A",
                "content": "Виявлення, аналіз, специфікація, перевірка потреб користувача, або властивостей розроблюваного ПЗ."
            },
            {
                "value": "B",
                "content": "Процес визначення архітектури, складу компонентів, інтерфейсів та інших характеристик до системи."
            },
            {
                "value": "C",
                "content": "Кодування, модульне та інтеграційне тестування, відлагодження."
            },
            {
                "value": "D",
                "content": "Перевірка поведінки системи на відповідність до специфікації, пошук дефектів."
            },
            {
                "value": "E",
                "content": "Поліпшення, оптимізація системи та процесів роботи з нею після вводу до експлуатації."
            }
        ],
        "correctAnswer": "E"
    },
    {
        "questionId": 58,
        "question": "Супроводжуванність - це",
        "answers": [
            {
                "value": "A",
                "content": "група властивостей, що характеризує можливість програмного забезпечення бути модифікованим для його виправлення, поліпшення або адаптації ПЗ до зміни в середовищі, вимогах або функціональних специфікаціях"
            },
            {
                "value": "B",
                "content": "група властивостей, що характеризується ступенем відповідності використовуваних ресурсів середовища функціонування рівню якості (надійності) функціонування програмного забезпечення при заданих умовах застосування"
            },
            {
                "value": "C",
                "content": "група властивостей програмного забезпечення, що забезпечує його пристосованість для перенесення з одного середовища функціонування в інші, зусилля для перенесення і адаптацію програмного забезпечення до нового середовища функціонування"
            }
        ],
        "correctAnswer": "A"
    },
    {
        "questionId": 59,
        "question": "Сутність структурного підходу до розробки програмних систем - це",
        "answers": [
            {
                "value": "A",
                "content": "генерація сімейств додатків (програмних застосунків) з окремих елементів компонентів, аспектів, сервісів, каркасів тощо"
            },
            {
                "value": "B",
                "content": "конструювання програм з алгебраїчними перетвореннями і функціями інтелектуальних агентів"
            },
            {
                "value": "C",
                "content": "декомпозиція (розбиття) системи на функції, які в свою чергу діляться на підфункції, на завдання і так далі"
            }
        ],
        "correctAnswer": "C"
    },
    {
        "questionId": 61,
        "question": "Тестування",
        "answers": [
            {
                "value": "A",
                "content": "Виявлення, аналіз, специфікація, перевірка потреб користувача, або властивостей розроблюваного ПЗ."
            },
            {
                "value": "B",
                "content": "Процес визначення архітектури, складу компонентів, інтерфейсів та інших характеристик до системи."
            },
            {
                "value": "C",
                "content": "Кодування, модульне та інтеграційне тестування, відлагодження."
            },
            {
                "value": "D",
                "content": "Перевірка поведінки системи на відповідність до специфікації, пошук дефектів."
            },
            {
                "value": "E",
                "content": "Поліпшення, оптимізація системи та процесів роботи з нею після вводу до експлуатації."
            }
        ],
        "correctAnswer": "D"
    },
    {
        "questionId": 62,
        "question": "Тестування ефективності програмного забезпечення не дозволяє перевірити",
        "answers": [
            {
                "value": "A",
                "content": "продуктивність"
            },
            {
                "value": "B",
                "content": "максимально допустиме навантаження"
            },
            {
                "value": "C",
                "content": "максимальний обсяг даних"
            },
            {
                "value": "D",
                "content": "роботу системи на різних конфігураціях апаратури"
            }
        ],
        "correctAnswer": "D"
    },
    {
        "questionId": 64,
        "question": "Функціональність - це:",
        "answers": [
            {
                "value": "A",
                "content": "сукупність властивостей, що визначають здатність програмного забезпечення виконувати певний перелік функцій, які задовольняють потребам відповідно до призначення"
            },
            {
                "value": "B",
                "content": "сукупність властивостей, що обумовлює здатність програмного забезпечення зберігати працездатність і перетворювати вихідні дані в результат за встановлений період часу"
            },
            {
                "value": "C",
                "content": "сукупність властивостей програмного забезпечення для передбачуваного кола користувачів і відображають легкість його освоєння і адаптації до постійно змінюваних умов експлуатації, стабільність роботи і підготовки даних, зрозумілість результатів, зручності внесення змін до програмної документацію і в програми"
            }
        ],
        "correctAnswer": "A"
    },
    {
        "questionId": 65,
        "question": "Чим вважається супровід відповідно до стандартів ISO / IEC 12207 та ISO / IEC 14764?",
        "answers": [
            {
                "value": "A",
                "content": "модифікацією програмного продукту в процесі експлуатації за умови збереження цілісності продукту"
            },
            {
                "value": "B",
                "content": "модифікацією програмного продукту в процесі експлуатації без збереження цілісності продукту"
            },
            {
                "value": "C",
                "content": "модифікацією програмного продукту до процесу експлуатації"
            }
        ],
        "correctAnswer": "A"
    },
    {
        "questionId": 67,
        "question": "Якість програмного забезпечення - це",
        "answers": [
            {
                "value": "A",
                "content": "ступінь автоматизації виконання завдань процесів життєвого циклу"
            },
            {
                "value": "B",
                "content": "вартість робіт з проектування та розробки програмного забезпечення"
            },
            {
                "value": "C",
                "content": "набір властивостей продукту, які характеризують його здатність задовольнити встановлені або передбачувані потреби замовника"
            }
        ],
        "correctAnswer": "C"
    },
    {
        "questionId": 68,
        "question": "Виберіть визначення 2-ої нормальної форми",
        "answers": [
            {
                "value": "A",
                "content": "Відношення знаходиться в 2-ій нормальній формі, якщо воно  знаходиться в 1-ій нормальній формі і всі атрибути є атомарними."
            },
            {
                "value": "B",
                "content": "Відношення Знаходиться В 2-ій Нормальній Формі, Якщо Воно Знаходиться В 1-Ій Нормальній Формі І Немає Функціональних Залежностей Між Неключовими Атрибутами І Частиною Первинного Ключа"
            },
            {
                "value": "C",
                "content": "Відношення Знаходиться В 2-ій Нормалній Формі, Якщо Воно Знаходиться В 1-ій Нормальній Формі І Немає Функціональних Залежностей Неключових Атрибутів Від Інших Неключових Атрибутів"
            }
        ],
        "correctAnswer": "B"
    },
    {
        "questionId": 69,
        "question": "Виберіть З Нижче Наведених Запитів Той, Який Містить Пов’язаний (Корельований) Запит",
        "answers": [
            {
                "value": "A",
                "content": "Select * From Student"
            },
            {
                "value": "B",
                "content": "Select Id, Name From (Select Id, Name From Student)"
            },
            {
                "value": "C",
                "content": "Select * From Student Where Id In (Select Id From Student Where Group_number = ‘641-П’)"
            },
            {
                "value": "D",
                "content": "Select * From Student A Where ocenka > (Select Avg(ocenka) From Student B Where A.Group_id = B.Group_i"
            }
        ],
        "correctAnswer": "D"
    },
    {
        "questionId": 70,
        "question": "Знайдіть Помилку В Sql Запиті: Create Table Student ( Student_id Integer, PRIMARY KEY (student_id),  Group_id Integer, FOREIGN KEY (Group_id) References Group (Group_id),  Fio Varchar(100) Unique Key,  Ocenka Float,  Check(Ocenka Between 3 And 5))",
        "answers": [
            {
                "value": "A",
                "content": "Помилки В Запиті Немає"
            },
            {
                "value": "B",
                "content": "Помилка Student_id Integer Primary Key"
            },
            {
                "value": "C",
                "content": "Помилка Fio Varchar(100) Unique Key"
            },
            {
                "value": "D",
                "content": "Помилка Check(Ocenka Between 3 And 5)"
            }
        ],
        "correctAnswer": "C"
    },
    {
        "questionId": 71,
        "question": "Знайдіть Помилку В Sql Запиті: Select sname, Group_name From Sgroup Inner Join Student  On SGroup.Group_id = Student.Group_id",
        "answers": [
            {
                "value": "A",
                "content": "Помилка Student As St"
            },
            {
                "value": "B",
                "content": "Помилка Sgroup Gr"
            },
            {
                "value": "C",
                "content": "Помилки В Запиті Немає"
            },
            {
                "value": "D",
                "content": "Ошибка Inner Join"
            }
        ],
        "correctAnswer": "C"
    },
    {
        "questionId": 72,
        "question": "Знайдіть синтаксичну Помилку В Sql Запиті:Select Gname From Sgroup Where Grid In (Select Grid From Student Group By Grid Having Count(Stid) > 5) Order By Gname",
        "answers": [
            {
                "value": "A",
                "content": "Помилки в Запиті Немає"
            },
            {
                "value": "B",
                "content": "Помилка Між Ключовими Словами Select і From"
            },
            {
                "value": "C",
                "content": "Помилка Після Ключового Слова Having"
            },
            {
                "value": "D",
                "content": "Помилка Після Ключового Слова Order By"
            }
        ],
        "correctAnswer": "B"
    },
    {
        "questionId": 73,
        "question": "Знайдіть Помилку В Sql Запиті:Select Group_name From Sgroup Where Group_id In (Select Group_id From Student Group By Group_id Having Count(Student_id) > 5 Order By Group_id)",
        "answers": [
            {
                "value": "A",
                "content": "Помилки В Запиті Немає"
            },
            {
                "value": "B",
                "content": "Помилка Між Ключовими Словами Select І From"
            },
            {
                "value": "C",
                "content": "Помилка Після Ключового Слова Where"
            }
        ],
        "correctAnswer": "B"
    },
    {
        "questionId": 74,
        "question": "Знайдіть Помилку В Sql Запиті:Select Student_id From Student Where Ocenka = (Select Ocenka From Student Where Group_id = 101)",
        "answers": [
            {
                "value": "A",
                "content": "Помилок В Запиті Немає"
            },
            {
                "value": "B",
                "content": "Помилка (Select Ocenka From"
            },
            {
                "value": "C",
                "content": "Помилка Where Ocenka = ("
            }
        ],
        "correctAnswer": "C"
    },
    {
        "questionId": 75,
        "question": "Знайдіть Помилку В Sql Запиті:Select Student_id From Student Where Ocenka = (Select Max(Ocenka) From Student Where Group_id = 101)",
        "answers": [
            {
                "value": "A",
                "content": "Помилки В Запиті Немає "
            },
            {
                "value": "B",
                "content": "Помилка Where Ocenka = ("
            },
            {
                "value": "C",
                "content": "Помилка (Select Max(Ocenka) From"
            }
        ],
        "correctAnswer": "A"
    },
    {
        "questionId": 76,
        "question": "Знайдіть Помилку В Sql Запиті:Select Student_id, Group_id From Student St, Sgroup Gr Where St.Group_id = Gr.Group_id",
        "answers": [
            {
                "value": "A",
                "content": "Помилки В Запиті Немає"
            },
            {
                "value": "B",
                "content": "Помилка Select Student_id, Group_id"
            },
            {
                "value": "C",
                "content": "Помилка Where St.Group_id = Gr.Group_id"
            },
            {
                "value": "D",
                "content": "Помилка Sgroup Gr"
            }
        ],
        "correctAnswer": "B"
    },
    {
        "questionId": 77,
        "question": "Знайдіть Помилку В Sql Запиті:Update Table Student Set Ocenka = 4 Where Student_id = 7",
        "answers": [
            {
                "value": "A",
                "content": "Помилки В Запиті Немає"
            },
            {
                "value": "B",
                "content": "Помилка Update Table Student"
            },
            {
                "value": "C",
                "content": "Помилка Set Ocenka = 4 Where"
            }
        ],
        "correctAnswer": "B"
    },
    {
        "questionId": 79,
        "question": "Знайдіть Помилку В Sql Запиті:Select * From Student Group By Group_id Order By Group_id",
        "answers": [
            {
                "value": "A",
                "content": "Помилки В Запиті Нема"
            },
            {
                "value": "B",
                "content": "Помилка Між Ключовими Словами Select і From"
            },
            {
                "value": "C",
                "content": "Помилка Після Ключового Слова Order By"
            }
        ],
        "correctAnswer": "A"
    },
    {
        "questionId": 80,
        "question": "Скільки Разів Виконується Пов’язаний (Корельований) Підзапит Для Непорожньої Таблиці :",
        "answers": [
            {
                "value": "A",
                "content": "Нуль Раз"
            },
            {
                "value": "B",
                "content": "Один Раз"
            },
            {
                "value": "C",
                "content": "Стільки Разів, Скільки Рядків Перегляне Зовнішній Запит"
            },
            {
                "value": "D",
                "content": "В Два Рази Більше, Ніж Кількість Рядків В Таблиці"
            }
        ],
        "correctAnswer": "C"
    }
];

export default quizQuestions;